// lib/junyeong_constants.dart

/// 준영매수법에 사용되는 종목별 통계 데이터 리스트입니다.
/// 이 리스트는 계속해서 데이터가 추가(add)될 수 있습니다.

// --------------------------------------------------------
// 1. TIGER 미국필라델피아반도체레버리지 (SOXL 추종)
// --------------------------------------------------------
// 데이터 출처: 11/11 ~ 11/21 (검증 완료)
// m값 로직: 부호 다르면 2.8, 같으면 0.83
final List<double> kf_list_phil = [0.24677, 1.59776, 0.88250, 0.74414, 1.13110];
final List<double> k_list_phil = [0.42369, 26.96225, 1.47957, 0.17568, 1.17241];
final List<double> kr_list_phil = [0.16055, -4.99301, 1.23602, 1.04530, 1.07079];

// --------------------------------------------------------
// 2. KODEX 미국나스닥 100레버리지 (TQQQ 추종)
// --------------------------------------------------------
// 데이터 출처: 11/11 ~ 11/21 (검증 완료)
// m값 로직: 무조건 0.99
final List<double> kf_list_kodex = [0.25521, 1.25615, 1.07750, 0.67562, 1.11339];
final List<double> k_list_kodex = [0.30078, 1.25615, 1.49192, 0.78638, 1.11339];
final List<double> kr_list_kodex = [0.16862, 0.28988, 1.02224, 0.69777, 0.98267];

// --------------------------------------------------------
// 3. TIGER 미국나스닥 100레버리지 (TQQQ 추종)
// --------------------------------------------------------
// 데이터 출처: 11/11 ~ 11/21 (검증 완료)
// m값 로직: 무조건 1.01
final List<double> kf_list_tiger = [0.37670, 0.74037, 0.94703, 0.76467, 1.10881];
final List<double> k_list_tiger = [0.60644, -0.51826, 1.14018, 0.91322, 1.11080];
final List<double> kr_list_tiger = [0.45535, 0.74037, 0.61682, 0.90104, 0.98516];